a=int(input("введите количество сторон вашей фигуры"))
if a==3:
    print('ваша фигура треугольник')
elif a==4:
    print("ваша фигура четырехугольник")
elif a==5:
    print("ваша фигура пятиугольник")
elif a==6:
    print("ваша фигура шестиугольник")
elif a==7:
    print("ваша фигура семиугольникк")
elif a==8:
    print("ваша фигура восьмиугольник")
elif a==9:
    print('ваша фигура девятиугольник')
elif a==10:
    print("ваша фигура десятиугольник")
else:
    print("введите число от 3 до 10")

# Evaluation: OK