# Размеры листы бумаги
papers = [[8, 9], [9, 8], [6, 8], [8, 6], [3, 4], [11, 9], [9, 11], ]

# Запрос у ползователся значения
envelop_x = int(input('Введите первый размер  конверта: '))
envelop_y = int(input('Введите второй размер  конверта: '))
a = 0

# Цикл для проверки
for i in range(7):
    # Проверяем условие: поместиться ли бумага в конвернте
    if (papers[a][0] < envelop_x and papers[a][1] < envelop_y) or (
            papers[a][0] < envelop_y and papers[a][1] < envelop_x):
        print('Да')
    else:
        print('Нет')
    a += 1

# Размеры кирпича
bricks = [[11, 10, 2], [11, 2, 10], [10, 11, 2], [10, 2, 11], [2, 10, 11], [2, 11, 10], [3, 5, 6], [3, 6, 5], [6, 3, 5],
          [6, 5, 3], [5, 6, 3], [5, 3, 6],
          [11, 3, 6], [11, 6, 3], [6, 11, 3], [6, 3, 11], [3, 6, 11], [3, 11, 6], ]

# Запрос у ползовтаеля значения
hole_x = int(input('Введите первый размер прямоугольного отверствия: '))
hole_y = int(input('Введите второй размер прямоугольного отверствия: '))
b = 0

# Цикл для проверки
for i in range(18):
    # Проверяем условие: пройдет ли кирпич через отверстие
    if (bricks[b][0] < hole_x and bricks[b][1] < hole_y) or (bricks[b][1] < hole_x and bricks[b][2] < hole_y) or (
            bricks[b][2] < hole_x and bricks[b][0] < hole_y):
        print('Да')
    else:
        print('Нет')
    b += 1
