import simple_draw as sd

# Нарисовать флаг России с древком
COLOR_RED = (255, 0, 0)
r=sd.left_bottom()
sd.rectangle(left_bottom=r, right_top, color=COLOR_YELLOW, width=0)


# Вокруг флага добавить не менее пяти воздушных шариков (эллипс + треугольник "хвостик" + прямая линия "ниточка")

# На заднем фоне нарисовать не менее трёх феерверков (группы разноцветных кругов разного
# относительно маленького диаметра, не менее 15 штук)

# Hint: для рисования однотипных объектов проще всего использовать функцию и цикл

# :(