import random


# Запрос у полозователся
s = int(input("Введите расстояние поездки в километрах: "))
x = random.randint(0, 1)


# Функция расчеты суммы поездки
def amount(r):
    if x == 0:
        print("Обычный тариф")
        if (r * 1000) % 150 == 0:
            sum = 4 + (r * 1000 / 150 * 0.25)
        else:
            sum = 4 + ((r * 1000 // 150 + 1) * 0.25)
    else:
        print("Повышенный тариф")
        if (r * 1000) % 150 == 0:
            sum = 4 + (r* 1000 / 150 * 0.25 * 2.5)
        else:
            sum = 4 + ((r * 1000 // 150 + 1) * 0.25 * 2.5)
    print('Сумма поездки: ', str(sum), '₽')


# Вызов функции
amount(s)

# OK